
  #### plan-nodes-20251130T194206.txt 📖: `success`
  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.tiles-test.onepassword_item.misc_config[0] will be updated in-place
  ~ resource "onepassword_item" "misc_config" {
        id       = "vaults/lyyqeg3pe6dvqdeb5hbiu7b76y/items/necdvhy3u3l4cm2kz7fzqme4ie"
      + password = (sensitive value)
        # (4 unchanged attributes hidden)

      ~ section {
            id    = "901c8b8d-bf4b-d6a1-2449-20d8b4852b3a"
            # (1 unchanged attribute hidden)

          + field {
              + id    = (known after apply)
              + label = "loki_bucket_chunks"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "loki_bucket_ruler"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "loki_bucket_admin"
              + type  = "STRING"
              + value = (sensitive value)
            }

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.tiles-test.module.k8s.module.loki_buckets.google_storage_bucket.buckets["admin"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-admin"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-loki-admin"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-loki-admin"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-admin"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption {
          + default_kms_key_name = "projects/symm-custodes/locations/us-east1/keyRings/tiles-test-loki/cryptoKeys/loki-storage"
        }

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.tiles-test.module.k8s.module.loki_buckets.google_storage_bucket.buckets["chunks"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-chunks"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-loki-chunks"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-loki-chunks"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-chunks"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption {
          + default_kms_key_name = "projects/symm-custodes/locations/us-east1/keyRings/tiles-test-loki/cryptoKeys/loki-storage"
        }

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = false
        }

      + website (known after apply)
    }

  # module.tiles-test.module.k8s.module.loki_buckets.google_storage_bucket.buckets["ruler"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-ruler"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-loki-ruler"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-loki-ruler"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-ruler"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption {
          + default_kms_key_name = "projects/symm-custodes/locations/us-east1/keyRings/tiles-test-loki/cryptoKeys/loki-storage"
        }

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.tiles-test.module.k8s.module.loki_buckets.google_storage_bucket_iam_binding.admins["admin"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-loki-admin"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.tiles-test.module.k8s.module.loki_buckets.google_storage_bucket_iam_binding.admins["chunks"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-loki-chunks"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.tiles-test.module.k8s.module.loki_buckets.google_storage_bucket_iam_binding.admins["ruler"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-loki-ruler"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.tiles-test.module.k8s.module.loki_encryption_key.google_kms_crypto_key_iam_binding.owners[0] will be created
  + resource "google_kms_crypto_key_iam_binding" "owners" {
      + crypto_key_id = "projects/symm-custodes/locations/us-east1/keyRings/tiles-test-loki/cryptoKeys/loki-storage"
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:tiles-tf-sa@symm-custodes.iam.gserviceaccount.com",
        ]
      + role          = "roles/owner"
    }

Plan: 7 to add, 1 to change, 0 to destroy.

  ```

  </details>
  
  